NetologySlow/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция СуммаПоСтроке(ИзмененнаяСтрока)   //0.0 
	//возвращает сумму с учетом количества и цены 
	ИзмененнаяСтрока.Сумма=ИзмененнаяСтрока.Количество*ИзмененнаяСтрока.Цена;    
	ИзмененнаяСтрока.СуммаСНДС=ИзмененнаяСтрока.Сумма+ИзмененнаяСтрока.СуммаНДС;  
КонецФункции   

 &НаКлиенте
Процедура ТоварыИУслугиНоменклатураПриИзменении(Элемент) //1.0 Номенклатура моя добавка
	// передать в качестве параметра ТекущиеДанные таблицы   
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
	ПриИзмененииНоменклатуры(ИзмененнаяСтрока); 
КонецПроцедуры    

 &НаКлиенте
Процедура  ПриИзмененииНоменклатуры(ИзмененнаяСтрока)    //1.1 Номенклатура моя добавка
	//а также заполнять ставку НДС(+) и вызвать процедуру ПриИзмененииСтавкиНДС     
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда   
		Номенклатура=ИзмененнаяСтрока.Номенклатура;  
		ИзмененнаяСтрока.СтавкаНДС=ПолучитьСтавкуНДС(Номенклатура); 
		ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);    
	КонецЕсли; 
КонецПроцедуры    

&НаСервереБезКонтекста
Функция  ПолучитьСтавкуНДС(Номенклатура) Экспорт
	СтавкаНДС=Номенклатура.СтавкаНДС; 
	Возврат СтавкаНДС; 
КонецФункции

 &НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)//2.0 Количество
	// передать в качестве параметра ТекущиеДанные таблицы   
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииКоличества(ИзмененнаяСтрока); 
КонецПроцедуры   

 &НаКлиенте
 Процедура  ПриИзмененииКоличества(ИзмененнаяСтрока) //2.1 Количество
	// Рассчитывать сумму по цене и количеству (вызовом СуммаПоСтроке()) и вызывать ПриИзмененииСуммы()
	Количество=ИзмененнаяСтрока.Количество; 
	СуммаПоСтроке (ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
 КонецПроцедуры  

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)//3.0 Цена
	// передать в качестве параметра ТекущиеДанные таблицы 
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииЦены(ИзмененнаяСтрока);
КонецПроцедуры   

&НаКлиенте
 Процедура  ПриИзмененииЦены(ИзмененнаяСтрока)//3.1  Цена
	// Рассчитывать сумму по цене и количеству (вызовом СуммаПоСтроке()) и вызывать ПриИзмененииСуммы()     
	Цена=ИзмененнаяСтрока.Цена; 
	СуммаПоСтроке(ИзмененнаяСтрока);    
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры     

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)//4.0 Ставка НДС
	//  передать в качестве параметра ТекущиеДанные таблицы   
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииСтавкиНДС(ИзмененнаяСтрока); 
КонецПроцедуры    

 &НаКлиенте
 Процедура  ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)//4.1 Ставка НДС
	// Рассчитывать сумму НДС по сумме и ставке вызовом НДСКлиентСервер.СуммаНДСПоСтавке()  
	ИзмененнаяСтрока.СуммаНДС=НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
	ПриИзмененииСуммыНДС(ИзмененнаяСтрока);   
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)//5.0 Сумма
	// передать в качестве параметра ТекущиеДанные таблицы    
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные;   
	ИзмененнаяСтрока.Цена=ИзмененнаяСтрока.Сумма/ИзмененнаяСтрока.Количество;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
 Процедура  ПриИзмененииСуммы(ИзмененнаяСтрока)//5.1 Сумма
	// Рассчитывать сумму НДС по сумме и ставке вызовом НДСКлиентСервер.СуммаНДСПоСтавке()  
    ИзмененнаяСтрока.СуммаНДС=НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС); 
	
	ПриИзмененииСуммыНДС(ИзмененнаяСтрока);
 КонецПроцедуры      

	
&НаКлиенте
Процедура ТоварыИУслугиСуммаНДСПриИзменении(Элемент)
	// передать в качестве параметра ТекущиеДанные таблицы.    //6.0 Сумма НДС (моя добавка)  
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииСуммыНДС(ИзмененнаяСтрока); 
КонецПроцедуры    

&НаКлиенте
 Процедура  ПриИзмененииСуммыНДС(ИзмененнаяСтрока)//6.1 Сумма НДС (моя добавка)
    //Рассчитать итоговую Сумму с НДС вызовом функции СуммаПоСтрокеСНДС(ИзмененнаяСтрока)
	СуммаСНДС=ИзмененнаяСтрока.СуммаНДС; 
	СуммаПоСтроке(ИзмененнаяСтрока);
КонецПроцедуры      

&НаКлиенте
Процедура Подбор(Команда)
	// Вставить содержимое обработчика. 
	//открыть //форму выбора справочника Номенклатура// с параметром ЗакрыватьПриВыборе = Ложь, указав в качестве владельца ТоварыИУслуги.  
     ПараметрыФормы=Новый Структура; 
     ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
     ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.ТоварыИУслуги); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	   СтандартнаяОбработка=Ложь;  
    //если в таблице еще нет выбранного значения - добавить строку 
	ЭлементВыбора=Новый Структура; 
    ЭлементВыбора.Вставить("Номенклатура",ВыбранноеЗначение); 
    Результат=Объект.ТоварыИУслуги.НайтиСтроки(ЭлементВыбора); 
    
    Если Результат.Количество()=0 Тогда
    	ИзмененнаяСтрока=Объект.ТоварыИУслуги.Добавить(); 
    	ИзмененнаяСтрока.Номенклатура=ВыбранноеЗначение;  
		ПриИзмененииНоменклатуры(ИзмененнаяСтрока);
    Иначе Сообщить(СтрШаблон("Номенклатура %1 уже есть в списке", ВыбранноеЗначение)); 
    КонецЕсли; 
КонецПроцедуры
